# Задача 1. Вывести квадрат числа

print('Введите число:')
a = int(input())
print('Квадрат числа', a, 'равен', a*a)

number = int(input('Enter the number:'))
print(f'{number}^2=={number **2}')